TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_lfss.h
/*****************************************************************************

  Copyright (C) 2025 Texas Instruments Incorporated - http://www.ti.com/

  Redistribution and use in source and binary forms, with or without
  modification, are permitted provided that the following conditions
  are met:

   Redistributions of source code must retain the above copyright
   notice, this list of conditions and the following disclaimer.

   Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the
   documentation and/or other materials provided with the
   distribution.

   Neither the name of Texas Instruments Incorporated nor the names of
   its contributors may be used to endorse or promote products derived
   from this software without specific prior written permission.

  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*****************************************************************************/

#ifndef ti_devices_msp_peripherals_hw_lfss__include
#define ti_devices_msp_peripherals_hw_lfss__include

/* Filename: hw_lfss.h */
/* Revised: 2023-09-04 05:06:06 */
/* Revision: 031875008c19c251e8c3a56bbee9e382e723e74e */

#ifndef __CORTEX_M
  #ifdef __cplusplus
    #define __I  volatile        /*!< Defines 'read only' permissions */
  #else
    #define __I  volatile const  /*!< Defines 'read only' permissions */
  #endif
  #define __O  volatile          /*!< Defines 'write only' permissions */
  #define __IO  volatile         /*!< Defines 'read / write' permissions */

  /* following defines should be used for structure members */
  #define __IM  volatile const   /*! Defines 'read only' structure member permissions */
  #define __OM  volatile         /*! Defines 'write only' structure member permissions */
  #define __IOM  volatile        /*! Defines 'read / write' structure member permissions */
#endif

/* Use standard integer types with explicit width */
#include <stdint.h>

#ifdef __cplusplus
 extern "C" {
#endif

#if defined ( __CC_ARM )
#pragma anon_unions
#endif

/******************************************************************************
* LFSS Registers
******************************************************************************/
#define LFSS_IPSPECIFIC_MEM_OFS                  ((uint32_t)0x00001400U)
#define LFSS_IPSPECIFIC_WDT_OFS                  ((uint32_t)0x00001300U)
#define LFSS_IPSPECIFIC_TIO_OFS                  ((uint32_t)0x00001200U)
#define LFSS_IPSPECIFIC_RTC_OFS                  ((uint32_t)0x00001100U)
#define LFSS_GEN_EVENT_OFS                       ((uint32_t)0x00001050U)
#define LFSS_CPU_INT_OFS                         ((uint32_t)0x00001020U)


/** @addtogroup LFSS_IPSPECIFIC_MEM
  @{
*/

typedef struct {
  __IO uint32_t SPMEM[32];                         /* !< (@ 0x00001400) Scratch Pad Memory Data Register */
       uint32_t RESERVED0[32];
  __IO uint32_t SPMWPROT0;                         /* !< (@ 0x00001500) Scratch Pad Memory Write Protect Register 0 */
  __IO uint32_t SPMWPROT1;                         /* !< (@ 0x00001504) Scratch Pad Memory Write Protect Register 1 */
  __IO uint32_t SPMWPROT2;                         /* !< (@ 0x00001508) Scratch Pad Memory Write Protect Register 2 */
  __IO uint32_t SPMWPROT3;                         /* !< (@ 0x0000150C) Scratch Pad Memory Write Protect Register 3 */
  __IO uint32_t SPMWPROT4;                         /* !< (@ 0x00001510) Scratch Pad Memory Write Protect Register 4 */
  __IO uint32_t SPMWPROT5;                         /* !< (@ 0x00001514) Scratch Pad Memory Write Protect Register 5 */
  __IO uint32_t SPMWPROT6;                         /* !< (@ 0x00001518) Scratch Pad Memory Write Protect Register 6 */
  __IO uint32_t SPMWPROT7;                         /* !< (@ 0x0000151C) Scratch Pad Memory Write Protect Register 7 */
       uint32_t RESERVED1[8];
  __IO uint32_t SPMTERASE0;                        /* !< (@ 0x00001540) Scratch Pad Memory Tamper Erase Register 0 */
  __IO uint32_t SPMTERASE1;                        /* !< (@ 0x00001544) Scratch Pad Memory Tamper Erase Register 1 */
  __IO uint32_t SPMTERASE2;                        /* !< (@ 0x00001548) Scratch Pad Memory Tamper Erase Register 2 */
  __IO uint32_t SPMTERASE3;                        /* !< (@ 0x0000154C) Scratch Pad Memory Tamper Erase Register 3 */
  __IO uint32_t SPMTERASE4;                        /* !< (@ 0x00001550) Scratch Pad Memory Tamper Erase Register 4 */
  __IO uint32_t SPMTERASE5;                        /* !< (@ 0x00001554) Scratch Pad Memory Tamper Erase Register 5 */
  __IO uint32_t SPMTERASE6;                        /* !< (@ 0x00001558) Scratch Pad Memory Tamper Erase Register 6 */
  __IO uint32_t SPMTERASE7;                        /* !< (@ 0x0000155C) Scratch Pad Memory Tamper Erase Register 7 */
} LFSS_IPSPECIFIC_MEM_Regs;

/*@}*/ /* end of group LFSS_IPSPECIFIC_MEM */

/** @addtogroup LFSS_IPSPECIFIC_WDT
  @{
*/

typedef struct {
  __IO uint32_t WDTEN;                             /* !< (@ 0x00001300) Watchdog Timer Enable Register */
  __IO uint32_t WDTDBGCTL;                         /* !< (@ 0x00001304) Watchdog Timer Debug Control Register */
  __IO uint32_t WDTCTL;                            /* !< (@ 0x00001308) Watchdog Timer Control Register */
  __O  uint32_t WDTCNTRST;                         /* !< (@ 0x0000130C) Watchdog Timer Counter Reset Register */
  __I  uint32_t WDTSTAT;                           /* !< (@ 0x00001310) Watchdog Timer Status Register */
       uint32_t RESERVED0[58];
  __IO uint32_t WDTLOCK;                           /* !< (@ 0x000013FC) Watchdog timer lock register */
} LFSS_IPSPECIFIC_WDT_Regs;

/*@}*/ /* end of group LFSS_IPSPECIFIC_WDT */

/** @addtogroup LFSS_IPSPECIFIC_TIO
  @{
*/

