TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_lfss.h
/* LFSS_STA Bits */
/* LFSS_STA[RTCRDY] Bits */
#define LFSS_STA_RTCRDY_OFS                      (0)                             /* !< RTCRDY Offset */
#define LFSS_STA_RTCRDY_MASK                     ((uint32_t)0x00000001U)         /* !< Real-time clock ready. This bit
                                                                                    indicates when the real-time clock
                                                                                    time values are safe for reading. */
#define LFSS_STA_RTCRDY_NOT_READY                ((uint32_t)0x00000000U)         /* !< RTC time values in transition */
#define LFSS_STA_RTCRDY_READY                    ((uint32_t)0x00000001U)         /* !< RTC time values safe for reading. */
/* LFSS_STA[RTCTCRDY] Bits */
#define LFSS_STA_RTCTCRDY_OFS                    (1)                             /* !< RTCTCRDY Offset */
#define LFSS_STA_RTCTCRDY_MASK                   ((uint32_t)0x00000002U)         /* !< Real-time clock temperature
                                                                                    compensation ready. This is a read
                                                                                    only bit that indicates when the
                                                                                    RTCTCMPx can be written. Write to
                                                                                    RTCTCMPx should be avoided when
                                                                                    RTCTCRDY is reset. */
#define LFSS_STA_RTCTCRDY_NOT_READY              ((uint32_t)0x00000000U)         /* !< RTC temperature compensation in
                                                                                    transition */
#define LFSS_STA_RTCTCRDY_READY                  ((uint32_t)0x00000002U)         /* !< RTC temperature compensation ready */
/* LFSS_STA[RTCTCOK] Bits */
#define LFSS_STA_RTCTCOK_OFS                     (2)                             /* !< RTCTCOK Offset */
#define LFSS_STA_RTCTCOK_MASK                    ((uint32_t)0x00000004U)         /* !< Real-time clock temperature
                                                                                    compensation write OK. This is a
                                                                                    read-only bit that indicates if the
                                                                                    write to RTCTCMP is successful or
                                                                                    not. */
#define LFSS_STA_RTCTCOK_NOT_OK                  ((uint32_t)0x00000000U)         /* !< Write to RTCTCMPx is unsuccessful */
#define LFSS_STA_RTCTCOK_OK                      ((uint32_t)0x00000004U)         /* !< Write to RTCTCMPx is successful */

/* LFSS_CAL Bits */
/* LFSS_CAL[RTCOCALX] Bits */
#define LFSS_CAL_RTCOCALX_OFS                    (0)                             /* !< RTCOCALX Offset */
#define LFSS_CAL_RTCOCALX_MASK                   ((uint32_t)0x000000FFU)         /* !< Real-time clock offset error
                                                                                    calibration. Each LSB represents
                                                                                    approximately +1ppm (RTCOCALXS = 1)
                                                                                    or -1ppm (RTCOCALXS = 0) adjustment
                                                                                    in frequency. Maximum effective
                                                                                    calibration value is +/-240ppm.
                                                                                    Excess values written above +/-240ppm
                                                                                    will be ignored by hardware. */
#define LFSS_CAL_RTCOCALX_MINIMUM                ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_CAL_RTCOCALX_MAXIMUM                ((uint32_t)0x000000FFU)         /* !< Highest possible value */
/* LFSS_CAL[RTCOCALS] Bits */
#define LFSS_CAL_RTCOCALS_OFS                    (15)                            /* !< RTCOCALS Offset */
#define LFSS_CAL_RTCOCALS_MASK                   ((uint32_t)0x00008000U)         /* !< Real-time clock offset error
                                                                                    calibration sign. This bit decides
                                                                                    the sign of offset error calibration. */
#define LFSS_CAL_RTCOCALS_DOWN                   ((uint32_t)0x00000000U)         /* !< Down calibration. Frequency
                                                                                    adjusted down. */
#define LFSS_CAL_RTCOCALS_UP                     ((uint32_t)0x00008000U)         /* !< Up calibration. Frequency adjusted
                                                                                    up. */
/* LFSS_CAL[RTCCALFX] Bits */
#define LFSS_CAL_RTCCALFX_OFS                    (16)                            /* !< RTCCALFX Offset */
#define LFSS_CAL_RTCCALFX_MASK                   ((uint32_t)0x00030000U)         /* !< Real-time clock calibration
                                                                                    frequency. Selects frequency output
                                                                                    to RTCCLK pin for calibration
                                                                                    measurement. The corresponding port
                                                                                    must be configured for the peripheral
                                                                                    module function. */
#define LFSS_CAL_RTCCALFX_F32KHZ                 ((uint32_t)0x00000000U)         /* !< 32 kHz */
#define LFSS_CAL_RTCCALFX_F512HZ                 ((uint32_t)0x00010000U)         /* !< 512 Hz */
#define LFSS_CAL_RTCCALFX_F256HZ                 ((uint32_t)0x00020000U)         /* !< 256 Hz */
#define LFSS_CAL_RTCCALFX_F1HZ                   ((uint32_t)0x00030000U)         /* !< 1 Hz */

/* LFSS_TCMP Bits */
/* LFSS_TCMP[RTCTCMPX] Bits */
#define LFSS_TCMP_RTCTCMPX_OFS                   (0)                             /* !< RTCTCMPX Offset */
#define LFSS_TCMP_RTCTCMPX_MASK                  ((uint32_t)0x000000FFU)         /* !< Real-time clock temperature
                                                                                    compensation. Value written into this
                                                                                    register is used for temperature
                                                                                    compensation of RTC. Each LSB
                                                                                    represents approximately +1ppm
                                                                                    (RTCTCMPS = 1) or -1ppm (RTCTCMPS =
                                                                                    0) adjustment in frequency. Maximum
                                                                                    effective calibration value is
                                                                                    +/-240ppm. Excess values written
                                                                                    above +/-240ppm are ignored by
                                                                                    hardware. Reading from RTCTCMP
                                                                                    register at any time returns the
                                                                                    cumulative value which is the signed
                                                                                    addition of RTCOCALx and RTCTCMPX
                                                                                    values, and the updated sign bit
                                                                                    (RTCTCMPS) of the addition result. */
#define LFSS_TCMP_RTCTCMPX_MINIMUM               ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_TCMP_RTCTCMPX_MAXIMUM               ((uint32_t)0x000000FFU)         /* !< Highest possible value */
/* LFSS_TCMP[RTCTCMPS] Bits */
#define LFSS_TCMP_RTCTCMPS_OFS                   (15)                            /* !< RTCTCMPS Offset */
#define LFSS_TCMP_RTCTCMPS_MASK                  ((uint32_t)0x00008000U)         /* !< Real-time clock temperature
                                                                                    compensation sign. This bit decides
                                                                                    the sign of temperature compensation. */
#define LFSS_TCMP_RTCTCMPS_DOWN                  ((uint32_t)0x00000000U)         /* !< Down calibration. Frequency
                                                                                    adjusted down. */
#define LFSS_TCMP_RTCTCMPS_UP                    ((uint32_t)0x00008000U)         /* !< Up calibration. Frequency adjusted
                                                                                    up. */

/* LFSS_SEC Bits */
/* LFSS_SEC[SECBIN] Bits */
#define LFSS_SEC_SECBIN_OFS                      (0)                             /* !< SECBIN Offset */
#define LFSS_SEC_SECBIN_MASK                     ((uint32_t)0x0000003FU)         /* !< Seconds Binary (0 to 59). If
                                                                                    RTCBCD=1 write to these bits will be
                                                                                    ignored and read give the value 0. */
#define LFSS_SEC_SECBIN_MINIMUM                  ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_SEC_SECBIN_MAXIMUM                  ((uint32_t)0x0000003BU)         /* !< Highest possible value */
/* LFSS_SEC[SECLOWBCD] Bits */
#define LFSS_SEC_SECLOWBCD_OFS                   (8)                             /* !< SECLOWBCD Offset */
#define LFSS_SEC_SECLOWBCD_MASK                  ((uint32_t)0x00000F00U)         /* !< Seconds BCD  low digit (0 to 9). If
                                                                                    RTCBCD=0 write to these bits will be
                                                                                    ignored and read give the value 0. */
#define LFSS_SEC_SECLOWBCD_MINIMUM               ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_SEC_SECLOWBCD_MAXIMUM               ((uint32_t)0x00000900U)         /* !< Highest possible value */
/* LFSS_SEC[SECHIGHBCD] Bits */
#define LFSS_SEC_SECHIGHBCD_OFS                  (12)                            /* !< SECHIGHBCD Offset */
#define LFSS_SEC_SECHIGHBCD_MASK                 ((uint32_t)0x00007000U)         /* !< Seconds BCD  high digit (0 to 5).
                                                                                    If RTCBCD=0 write to these bits will
                                                                                    be ignored and read give the value 0. */
#define LFSS_SEC_SECHIGHBCD_MINIMUM              ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_SEC_SECHIGHBCD_MAXIMUM              ((uint32_t)0x00005000U)         /* !< Highest possible value */

/* LFSS_MIN Bits */
/* LFSS_MIN[MINBIN] Bits */
#define LFSS_MIN_MINBIN_OFS                      (0)                             /* !< MINBIN Offset */
#define LFSS_MIN_MINBIN_MASK                     ((uint32_t)0x0000003FU)         /* !< Minutes Binary (0 to 59). If
                                                                                    RTCBCD=1 write to these bits will be
                                                                                    ignored and read give the value 0. */
#define LFSS_MIN_MINBIN_MINIMUM                  ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_MIN_MINBIN_MAXIMUM                  ((uint32_t)0x0000003BU)         /* !< Highest possible value */
/* LFSS_MIN[MINLOWBCD] Bits */
#define LFSS_MIN_MINLOWBCD_OFS                   (8)                             /* !< MINLOWBCD Offset */
#define LFSS_MIN_MINLOWBCD_MASK                  ((uint32_t)0x00000F00U)         /* !< Minutes BCD  low digit (0 to 9). If
                                                                                    RTCBCD=0 write to these bits will be
                                                                                    ignored and read give the value 0. */
#define LFSS_MIN_MINLOWBCD_MINIMUM               ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_MIN_MINLOWBCD_MAXIMUM               ((uint32_t)0x00000900U)         /* !< Highest possible value */
/* LFSS_MIN[MINHIGHBCD] Bits */
#define LFSS_MIN_MINHIGHBCD_OFS                  (12)                            /* !< MINHIGHBCD Offset */
#define LFSS_MIN_MINHIGHBCD_MASK                 ((uint32_t)0x00007000U)         /* !< Minutes BCD  high digit (0 to 5).
                                                                                    If RTCBCD=0 write to these bits will
                                                                                    be ignored and read give the value 0. */
#define LFSS_MIN_MINHIGHBCD_MINIMUM              ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_MIN_MINHIGHBCD_MAXIMUM              ((uint32_t)0x00005000U)         /* !< Highest possible value */

/* LFSS_HOUR Bits */
/* LFSS_HOUR[HOURBIN] Bits */
#define LFSS_HOUR_HOURBIN_OFS                    (0)                             /* !< HOURBIN Offset */
#define LFSS_HOUR_HOURBIN_MASK                   ((uint32_t)0x0000001FU)         /* !< Hours Binary (0 to 23). If RTCBCD=1
                                                                                    write to these bits will be ignored
                                                                                    and read give the value 0. */
#define LFSS_HOUR_HOURBIN_MINIMUM                ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_HOUR_HOURBIN_MAXIMUM                ((uint32_t)0x00000017U)         /* !< Highest possible value */
/* LFSS_HOUR[HOURLOWBCD] Bits */
#define LFSS_HOUR_HOURLOWBCD_OFS                 (8)                             /* !< HOURLOWBCD Offset */
#define LFSS_HOUR_HOURLOWBCD_MASK                ((uint32_t)0x00000F00U)         /* !< Hours BCD  low digit (0 to 9). If
                                                                                    RTCBCD=0 write to these bits will be
                                                                                    ignored and read give the value 0. */
#define LFSS_HOUR_HOURLOWBCD_MINIMUM             ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_HOUR_HOURLOWBCD_MAXIMUM             ((uint32_t)0x00000900U)         /* !< Highest possible value */
/* LFSS_HOUR[HOURHIGHBCD] Bits */
#define LFSS_HOUR_HOURHIGHBCD_OFS                (12)                            /* !< HOURHIGHBCD Offset */
#define LFSS_HOUR_HOURHIGHBCD_MASK               ((uint32_t)0x00003000U)         /* !< Hours BCD  high digit (0 to 2). If
                                                                                    RTCBCD=0 write to these bits will be
                                                                                    ignored and read give the value 0. */
#define LFSS_HOUR_HOURHIGHBCD_MINIMUM            ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_HOUR_HOURHIGHBCD_MAXIMUM            ((uint32_t)0x00002000U)         /* !< Highest possible value */

/* LFSS_DAY Bits */
/* LFSS_DAY[DOW] Bits */
#define LFSS_DAY_DOW_OFS                         (0)                             /* !< DOW Offset */
#define LFSS_DAY_DOW_MASK                        ((uint32_t)0x00000007U)         /* !< Day of week (0 to 6). These bits
                                                                                    are valid if RTCBCD=1 or RTCBCD=0. */
#define LFSS_DAY_DOW_MINIMUM                     ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_DAY_DOW_MAXIMUM                     ((uint32_t)0x00000006U)         /* !< Highest possible value */
/* LFSS_DAY[DOMBIN] Bits */
#define LFSS_DAY_DOMBIN_OFS                      (8)                             /* !< DOMBIN Offset */
#define LFSS_DAY_DOMBIN_MASK                     ((uint32_t)0x00001F00U)         /* !< Day of month Binary (1 to 28, 29,
                                                                                    30, 31). If RTCBCD=1 write to these
                                                                                    bits will be ignored and read give
                                                                                    the value 0. */
#define LFSS_DAY_DOMBIN_MINIMUM                  ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_DAY_DOMBIN_MAXIMUM                  ((uint32_t)0x00001F00U)         /* !< Highest possible value */
/* LFSS_DAY[DOMLOWBCD] Bits */
#define LFSS_DAY_DOMLOWBCD_OFS                   (16)                            /* !< DOMLOWBCD Offset */
#define LFSS_DAY_DOMLOWBCD_MASK                  ((uint32_t)0x000F0000U)         /* !< Day of month BCD  low digit (0 to
                                                                                    9). If RTCBCD=0 write to these bits
                                                                                    will be ignored and read give the
                                                                                    value 0. */
#define LFSS_DAY_DOMLOWBCD_MINIMUM               ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_DAY_DOMLOWBCD_MAXIMUM               ((uint32_t)0x00090000U)         /* !< Highest possible value */
/* LFSS_DAY[DOMHIGHBCD] Bits */
#define LFSS_DAY_DOMHIGHBCD_OFS                  (20)                            /* !< DOMHIGHBCD Offset */
#define LFSS_DAY_DOMHIGHBCD_MASK                 ((uint32_t)0x00300000U)         /* !< Day of month BCD  high digit (0 to
                                                                                    3). If RTCBCD=0 write to these bits
                                                                                    will be ignored and read give the
                                                                                    value 0. */
#define LFSS_DAY_DOMHIGHBCD_MINIMUM              ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_DAY_DOMHIGHBCD_MAXIMUM              ((uint32_t)0x00300000U)         /* !< Highest possible value */

/* LFSS_MON Bits */
/* LFSS_MON[MONBIN] Bits */
#define LFSS_MON_MONBIN_OFS                      (0)                             /* !< MONBIN Offset */
#define LFSS_MON_MONBIN_MASK                     ((uint32_t)0x0000000FU)         /* !< Month Binary (1 to 12). If RTCBCD=1
                                                                                    write to these bits will be ignored
                                                                                    and read give the value 0. */
#define LFSS_MON_MONBIN_MINIMUM                  ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_MON_MONBIN_MAXIMUM                  ((uint32_t)0x0000000CU)         /* !< Highest possible value */
/* LFSS_MON[MONLOWBCD] Bits */
#define LFSS_MON_MONLOWBCD_OFS                   (8)                             /* !< MONLOWBCD Offset */
#define LFSS_MON_MONLOWBCD_MASK                  ((uint32_t)0x00000F00U)         /* !< Month BCD  low digit (0 to 9). If
                                                                                    RTCBCD=0 write to these bits will be
                                                                                    ignored and read give the value 0. */
#define LFSS_MON_MONLOWBCD_MINIMUM               ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_MON_MONLOWBCD_MAXIMUM               ((uint32_t)0x00000900U)         /* !< Highest possible value */
/* LFSS_MON[MONHIGHBCD] Bits */
#define LFSS_MON_MONHIGHBCD_OFS                  (12)                            /* !< MONHIGHBCD Offset */
#define LFSS_MON_MONHIGHBCD_MASK                 ((uint32_t)0x00001000U)         /* !< Month BCD  high digit (0 or 1). If
                                                                                    RTCBCD=0 write to these bits will be
                                                                                    ignored and read give the value 0. */
#define LFSS_MON_MONHIGHBCD_MINIMUM              ((uint32_t)0x00000000U)         /* !< Smallest value */
#define LFSS_MON_MONHIGHBCD_MAXIMUM              ((uint32_t)0x00001000U)         /* !< Highest possible value */

