TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_lfss.h
/* LFSS_TSSTAT Bits */
/* LFSS_TSSTAT[TSTIOEVT0] Bits */
#define LFSS_TSSTAT_TSTIOEVT0_OFS                (0)                             /* !< TSTIOEVT0 Offset */
#define LFSS_TSSTAT_TSTIOEVT0_MASK               ((uint32_t)0x00000001U)         /* !< Tamper I/O 0 caused time stamp
                                                                                    event */
#define LFSS_TSSTAT_TSTIOEVT0_CLR                ((uint32_t)0x00000000U)         /* !< no event detected */
#define LFSS_TSSTAT_TSTIOEVT0_SET                ((uint32_t)0x00000001U)         /* !< event detected */
/* LFSS_TSSTAT[TSTIOEVT1] Bits */
#define LFSS_TSSTAT_TSTIOEVT1_OFS                (1)                             /* !< TSTIOEVT1 Offset */
#define LFSS_TSSTAT_TSTIOEVT1_MASK               ((uint32_t)0x00000002U)         /* !< Tamper I/O 1 caused time stamp
                                                                                    event */
#define LFSS_TSSTAT_TSTIOEVT1_CLR                ((uint32_t)0x00000000U)         /* !< no event detected */
#define LFSS_TSSTAT_TSTIOEVT1_SET                ((uint32_t)0x00000002U)         /* !< event detected */
/* LFSS_TSSTAT[TSTIOEVT2] Bits */
#define LFSS_TSSTAT_TSTIOEVT2_OFS                (2)                             /* !< TSTIOEVT2 Offset */
#define LFSS_TSSTAT_TSTIOEVT2_MASK               ((uint32_t)0x00000004U)         /* !< Tamper I/O 2 caused time stamp
                                                                                    event */
#define LFSS_TSSTAT_TSTIOEVT2_CLR                ((uint32_t)0x00000000U)         /* !< no event detected */
#define LFSS_TSSTAT_TSTIOEVT2_SET                ((uint32_t)0x00000004U)         /* !< event detected */
/* LFSS_TSSTAT[TSTIOEVT3] Bits */
#define LFSS_TSSTAT_TSTIOEVT3_OFS                (3)                             /* !< TSTIOEVT3 Offset */
#define LFSS_TSSTAT_TSTIOEVT3_MASK               ((uint32_t)0x00000008U)         /* !< Tamper I/O 3 caused time stamp
                                                                                    event */
#define LFSS_TSSTAT_TSTIOEVT3_CLR                ((uint32_t)0x00000000U)         /* !< no event detected */
#define LFSS_TSSTAT_TSTIOEVT3_SET                ((uint32_t)0x00000008U)         /* !< event detected */
/* LFSS_TSSTAT[TSTIOEVT4] Bits */
#define LFSS_TSSTAT_TSTIOEVT4_OFS                (4)                             /* !< TSTIOEVT4 Offset */
#define LFSS_TSSTAT_TSTIOEVT4_MASK               ((uint32_t)0x00000010U)         /* !< Tamper I/O 4 caused time stamp
                                                                                    event */
#define LFSS_TSSTAT_TSTIOEVT4_CLR                ((uint32_t)0x00000000U)         /* !< no event detected */
#define LFSS_TSSTAT_TSTIOEVT4_SET                ((uint32_t)0x00000010U)         /* !< event detected */
/* LFSS_TSSTAT[TSTIOEVT5] Bits */
#define LFSS_TSSTAT_TSTIOEVT5_OFS                (5)                             /* !< TSTIOEVT5 Offset */
#define LFSS_TSSTAT_TSTIOEVT5_MASK               ((uint32_t)0x00000020U)         /* !< Tamper I/O 5 caused time stamp
                                                                                    event */
#define LFSS_TSSTAT_TSTIOEVT5_CLR                ((uint32_t)0x00000000U)         /* !< no event detected */
#define LFSS_TSSTAT_TSTIOEVT5_SET                ((uint32_t)0x00000020U)         /* !< event detected */
/* LFSS_TSSTAT[TSTIOEVT6] Bits */
#define LFSS_TSSTAT_TSTIOEVT6_OFS                (6)                             /* !< TSTIOEVT6 Offset */
#define LFSS_TSSTAT_TSTIOEVT6_MASK               ((uint32_t)0x00000040U)         /* !< Tamper I/O 6 caused time stamp
                                                                                    event */
#define LFSS_TSSTAT_TSTIOEVT6_CLR                ((uint32_t)0x00000000U)         /* !< no event detected */
#define LFSS_TSSTAT_TSTIOEVT6_SET                ((uint32_t)0x00000040U)         /* !< event detected */
/* LFSS_TSSTAT[TSTIOEVT7] Bits */
#define LFSS_TSSTAT_TSTIOEVT7_OFS                (7)                             /* !< TSTIOEVT7 Offset */
#define LFSS_TSSTAT_TSTIOEVT7_MASK               ((uint32_t)0x00000080U)         /* !< Tamper I/O 7 caused time stamp
                                                                                    event */
#define LFSS_TSSTAT_TSTIOEVT7_CLR                ((uint32_t)0x00000000U)         /* !< no event detected */
#define LFSS_TSSTAT_TSTIOEVT7_SET                ((uint32_t)0x00000080U)         /* !< event detected */
/* LFSS_TSSTAT[TSTIOEVT8] Bits */
#define LFSS_TSSTAT_TSTIOEVT8_OFS                (8)                             /* !< TSTIOEVT8 Offset */
#define LFSS_TSSTAT_TSTIOEVT8_MASK               ((uint32_t)0x00000100U)         /* !< Tamper I/O 8 caused time stamp
                                                                                    event */
#define LFSS_TSSTAT_TSTIOEVT8_CLR                ((uint32_t)0x00000000U)         /* !< no event detected */
#define LFSS_TSSTAT_TSTIOEVT8_SET                ((uint32_t)0x00000100U)         /* !< event detected */
/* LFSS_TSSTAT[TSTIOEVT9] Bits */
#define LFSS_TSSTAT_TSTIOEVT9_OFS                (9)                             /* !< TSTIOEVT9 Offset */
#define LFSS_TSSTAT_TSTIOEVT9_MASK               ((uint32_t)0x00000200U)         /* !< Tamper I/O 9 caused time stamp
                                                                                    event */
#define LFSS_TSSTAT_TSTIOEVT9_CLR                ((uint32_t)0x00000000U)         /* !< no event detected */
#define LFSS_TSSTAT_TSTIOEVT9_SET                ((uint32_t)0x00000200U)         /* !< event detected */
/* LFSS_TSSTAT[TSTIOEVT10] Bits */
#define LFSS_TSSTAT_TSTIOEVT10_OFS               (10)                            /* !< TSTIOEVT10 Offset */
#define LFSS_TSSTAT_TSTIOEVT10_MASK              ((uint32_t)0x00000400U)         /* !< Tamper I/O 10 caused time stamp
                                                                                    event */
#define LFSS_TSSTAT_TSTIOEVT10_CLR               ((uint32_t)0x00000000U)         /* !< no event detected */
#define LFSS_TSSTAT_TSTIOEVT10_SET               ((uint32_t)0x00000400U)         /* !< event detected */
/* LFSS_TSSTAT[TSTIOEVT11] Bits */
#define LFSS_TSSTAT_TSTIOEVT11_OFS               (11)                            /* !< TSTIOEVT11 Offset */
#define LFSS_TSSTAT_TSTIOEVT11_MASK              ((uint32_t)0x00000800U)         /* !< Tamper I/O 11 caused time stamp
                                                                                    event */
#define LFSS_TSSTAT_TSTIOEVT11_CLR               ((uint32_t)0x00000000U)         /* !< no event detected */
#define LFSS_TSSTAT_TSTIOEVT11_SET               ((uint32_t)0x00000800U)         /* !< event detected */
/* LFSS_TSSTAT[TSTIOEVT12] Bits */
#define LFSS_TSSTAT_TSTIOEVT12_OFS               (12)                            /* !< TSTIOEVT12 Offset */
#define LFSS_TSSTAT_TSTIOEVT12_MASK              ((uint32_t)0x00001000U)         /* !< Tamper I/O 12 caused time stamp
                                                                                    event */
#define LFSS_TSSTAT_TSTIOEVT12_CLR               ((uint32_t)0x00000000U)         /* !< no event detected */
#define LFSS_TSSTAT_TSTIOEVT12_SET               ((uint32_t)0x00001000U)         /* !< event detected */
/* LFSS_TSSTAT[TSTIOEVT13] Bits */
#define LFSS_TSSTAT_TSTIOEVT13_OFS               (13)                            /* !< TSTIOEVT13 Offset */
#define LFSS_TSSTAT_TSTIOEVT13_MASK              ((uint32_t)0x00002000U)         /* !< Tamper I/O 13 caused time stamp
                                                                                    event */
#define LFSS_TSSTAT_TSTIOEVT13_CLR               ((uint32_t)0x00000000U)         /* !< no event detected */
#define LFSS_TSSTAT_TSTIOEVT13_SET               ((uint32_t)0x00002000U)         /* !< event detected */
/* LFSS_TSSTAT[TSTIOEVT14] Bits */
#define LFSS_TSSTAT_TSTIOEVT14_OFS               (14)                            /* !< TSTIOEVT14 Offset */
#define LFSS_TSSTAT_TSTIOEVT14_MASK              ((uint32_t)0x00004000U)         /* !< Tamper I/O 14 caused time stamp
                                                                                    event */
#define LFSS_TSSTAT_TSTIOEVT14_CLR               ((uint32_t)0x00000000U)         /* !< no event detected */
#define LFSS_TSSTAT_TSTIOEVT14_SET               ((uint32_t)0x00004000U)         /* !< event detected */
/* LFSS_TSSTAT[TSTIOEVT15] Bits */
#define LFSS_TSSTAT_TSTIOEVT15_OFS               (15)                            /* !< TSTIOEVT15 Offset */
#define LFSS_TSSTAT_TSTIOEVT15_MASK              ((uint32_t)0x00008000U)         /* !< Tamper I/O 15 caused time stamp
                                                                                    event */
#define LFSS_TSSTAT_TSTIOEVT15_CLR               ((uint32_t)0x00000000U)         /* !< no event detected */
#define LFSS_TSSTAT_TSTIOEVT15_SET               ((uint32_t)0x00008000U)         /* !< event detected */
/* LFSS_TSSTAT[TSVDDEVT] Bits */
#define LFSS_TSSTAT_TSVDDEVT_OFS                 (16)                            /* !< TSVDDEVT Offset */
#define LFSS_TSSTAT_TSVDDEVT_MASK                ((uint32_t)0x00010000U)         /* !< Loss of VDD caused time stamp event */
#define LFSS_TSSTAT_TSVDDEVT_CLR                 ((uint32_t)0x00000000U)         /* !< no event detected */
#define LFSS_TSSTAT_TSVDDEVT_SET                 ((uint32_t)0x00010000U)         /* !< event detected */

